docs/todo/Rethink-2025-12.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-12-09 二 10:29 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>对2025年的自我反思以及最后一个月的生存计划</title>
<meta name="author" content="梁子" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/about.html" class="button">About</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">对2025年的自我反思以及最后一个月的生存计划</h1>
<div id="outline-container-org4490da2" class="outline-2">
<h2 id="org4490da2"><span class="section-number-2">1.</span> Preliminary</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org66c3b48" class="outline-3">
<h3 id="org66c3b48"><span class="section-number-3">1.1.</span> 实验性质的人生目标</h3>
<div class="outline-text-3" id="text-1-1">
<p>
成为中文语境传统下的“好”。即梦想成为，在儒家意义下的君子与圣人，达到修齐治平的统一和为此所需要的一切道德上的以及美学上的需求，立功立言立德；无限趋近于道，晓知天，保持纯洁纯一的赤子之心；解除自我的烦恼，具备传道人的特质，面对任何事情都不能失神或无主，即使是死亡。
</p>

<p>
在上述自我的建立上，成为一个把一生献给人类的人。
</p>


<p>
将上述目标按照现象学理论进行拆解：
</p>
</div>
</div>
<div id="outline-container-orgc6c8b73" class="outline-3">
<h3 id="orgc6c8b73"><span class="section-number-3">1.2.</span> 对人生的现象学分析与庸俗性表达</h3>
<div class="outline-text-3" id="text-1-2">
<p>
按照现象学理论，将对自我人生状态的观测拆为若干维度：
</p>
<ul class="org-ul">
<li>我的内心是否平静？</li>
<li>我的生活是否是有计划性的、受到自我意识控制的？</li>
<li>我是否离“道”越来越近？</li>
<li>我是否能够充分感觉到自我的进步？</li>
<li>我的身体是否越来越好？</li>
<li>我有没有照顾到自我的情绪？</li>
</ul>

<p>
如是，从世俗生活的角度进行进一步拆解：
</p>

<ul class="org-ul">
<li>身体素质
<ul class="org-ul">
<li>睡眠状况</li>
<li>跑步量</li>
<li>武侠量</li>
<li>比赛量</li>
<li>健身量</li>
</ul></li>
<li>心境
<ul class="org-ul">
<li>止量</li>
<li>观量</li>
</ul></li>
<li>工作
<ul class="org-ul">
<li>代码提交量</li>
<li>科研时间</li>
</ul></li>
<li>情绪
<ul class="org-ul">
<li>面对面的交谈量</li>
<li>线上交谈量</li>
<li>新的人认识量</li>
<li>旧的人认识量</li>
</ul></li>
<li>成长性
<ul class="org-ul">
<li>对无意识行为的杜绝程度（即推荐系统的排斥程度）</li>
<li>计划性</li>
<li>维护自我成长性体系</li>
</ul></li>
</ul>


<p>
后续内容便是基于以上维度进行评判。
</p>
</div>
</div>
</div>
<div id="outline-container-orgc6c8a69" class="outline-2">
<h2 id="orgc6c8a69"><span class="section-number-2">2.</span> 宏观上的反思</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>在过去一年，我很显然没有思考清楚人生意义的问题。很明显我在思维上已经否定了享乐主义，并且认为我的人生意义是建构出诸如“沙滩上的城堡”这种具有美学上的比喻的东西，但是这个东西是严重脱节的。——即这个比喻承认了自我所做行为的悲壮以及承认了每个人的意义的不同，但是这个比喻 <code>严重脱节于</code> 我的现实世界的行为，使得我与现实世界里的一切行为产生了脱节。这是一个大而空的东西。</li>
<li>在过去一年，我对于人生的自我规划是完全失灵的。我只是在大脑里隐隐有一个人生规划，类似于“过去一年我要做三篇论文”这种。这导致我整个的一年可以说是毫无建树，除了科研。我急需一套新的方法来重新掌控自己颓废而堕落的一年。</li>
<li>在过去一年，我沉迷于推荐系统和手机。——这是由于我的无目标性造成的。</li>
<li>在过去一年，每次面对巨大的困难，我都会退缩，然后浪费掉大量的时间。——这是由于我脆弱的主体性和在方法论上的巨大缺陷造成的。</li>
</ul>
</div>
</div>
<div id="outline-container-orgbdeab1a" class="outline-2">
<h2 id="orgbdeab1a"><span class="section-number-2">3.</span> 具体的思考</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>身体素质
<ul class="org-ul">
<li>睡眠：我应该严格执行10:45睡眠制度，并以切香肠的方式提前。这个时间为红线。</li>
<li>跑步：我抛弃了去年培养的跑步习惯，这是巨大的错误。我应该立刻重新捡起这个习惯。</li>
<li>武侠：我应该立刻捡起这个习惯。</li>
<li>比赛：还可以。因为总有人可以约，所以我一直在被动参加。</li>
<li>健身：我不应该对健身表达任何生理上的厌恶。我厌恶的只是健身背后所代表的那种功利性的态度和一个人卖弄自己身体的恶心感觉，但是我不应该否认肌肉训练、耐力训练等训练的积极意义。同样地，我自己本身也常常在这些训练当中受益，所以我更不应该否认他们。我应该重拾他们。</li>
</ul></li>
<li>心境
<ul class="org-ul">
<li>止：我学会了安那般那。但是需要提高。</li>
<li>观：毫无进展。</li>
</ul></li>
<li>工作
<ul class="org-ul">
<li>代码提交量：自从8月份后，出现了巨大的下滑。</li>
<li>科研时间：自从八月份后，出现了巨大的下滑。我应该重新约束自己的科研时间，保证6个小时每天的基础科研时间，并列为红线。</li>
</ul></li>
<li>情绪
<ul class="org-ul">
<li>我不应该让自己有太多的情绪波动。</li>
<li>我应该永远真诚微笑地对待他人，包容他人，无论他们对我做了什么。当然，我不能放弃我的直率的一面，但是要怀有礼貌。</li>
<li>新人：我应当移除自我的社恐特性。社恐不符合周礼对君子的要求。我应当成为一个游刃有余地进行社交的人，不应该在线上或线下的交流中呈现出任何的对沟通渠道的偏好。我应当对男生和女生保持同样的热情，不应当对女人由于生理特性的特点表达出任何偏好，或者对男人由于相同点过多而表达出任何偏好。我应当足够谦虚、足够自信、同时在举止之间表达出符合君子行为的一切。</li>
<li>旧人：永远维护旧人之间的感情。永远谦虚、尊重他们。要善于倾听理解他们的情绪，倾尽自己的能力解决他们的困难，与他们站在一起。如若需要给他们倾诉，要合理考虑倾诉的量，同时不要给他们造成太多麻烦。要记得赞美和保持礼貌。</li>
</ul></li>
<li>成长性
<ul class="org-ul">
<li>无意识行为：在禁欲、禁APP等行为上进行系统性的监测。</li>
<li>计划性：事实证明，现有的emacs org mode的使用并不有效。我应该使用基于时间的TODO计划当中。事实证明，没有计划的话，无意识的时间消耗很容易产生，生活的掌控感也会被无限制削弱。</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org73ed3c0" class="outline-2">
<h2 id="org73ed3c0"><span class="section-number-2">4.</span> 未来的计划</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>从现在开始，撰写今日计划、明日计划、昨日反思。如此循环下去。</li>
<li>从现在开始，约健身房，恢复跑步。</li>
<li>今晚10:45睡觉。</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr class="Solid"> <div class="info"> <span class="author">Author: 梁子 (<a href="mailto:2273067585@qq.com">2273067585@qq.com</a>)</span> <span class="date">Create Date: Tue Dec  9 09:48:50 2025</span> <span class="date">Last modified: 2025-12-09 二 10:28</span> <span>Creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</span> </div>
</div>
</body>
</html>
